cgueble/ESP8266_Thermo_Num/Wifi-thermo-num/build/sketch/Wifi-thermo-num.ino.cpp
#include <Arduino.h>
#line 1 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
#line 1 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <TimeLib.h>
#include <PubSubClient.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <Codes_Pouilly.h>// contient toutes les variables avec les loggins et les codes

//****************Configuration pour Debug****************
const boolean SERIAL_PORT_LOG_ENABLE = true; //true pour avoir la console active et false pour la desactiver ; il faut la desactiver pour l'application car meme pour que "verrou"
const boolean AvecMail = false; //true pour activer les mails
const boolean AvecWifi = true; // true pour activer le wifi

//Declaration des compteurs


String CurentSSID;
String CurentSSIDTry;
//Definition des chaines de characteres pour les mails
String MailContent = "no mail content defined\r\n";
String StringDate = "no date";
String StringTime = "no time";

//Definition des Inputs

//Definition des Outputs
int thermo_Power = 0; //ONEWIRE is plugged into pin 5 on GPIO_0 the Arduinol'alimentation des thermometre se fera sur GPIO2 c'est a dire D2 c'est a dire la pin 3 de la carte ESP8266-E01 ; c'est une output

#define ONE_WIRE_BUS 2 // l'alimentation des thermometre se fera sur GPIO2 c'est a dire D2 c'est a dire la pin 3 de la carte ESP8266-E01 ; c'est une output
#define TEMPERATURE_PRECISION 10
  
OneWire oneWire(ONE_WIRE_BUS); // Setup a oneWire instance to communicate with any OneWire devices
DallasTemperature sensors(&oneWire); // Pass our oneWire reference to Dallas Temperature.
#define NumberOfDevices 3
byte totalDevices;
//Sensor Adresses 
byte allAddress [NumberOfDevices][8];//Permet d'explorer tous les sensors
DeviceAddress SensorBoard = { 0x28, 0xFF, 0x0F, 0xEA, 0x00, 0x17, 0x04, 0x96 };//Sensor soldered on board
DeviceAddress SensorExt; //external sensor
DeviceAddress SensorChauf; // Sensor circuit de chauffage
byte onBoardDeviceNumber=0;
byte chaufDeviceNumber=0;
byte extDeviceNumber=0;

byte Sensor_addr[8][8];

//Definition var for temperature monitoring
int ThempBoard = 90;
int ThempExt = 90;
int ThempChauf = 90;
int ThempMin = 5;// Temperature min a partir de laquelle 1 mail par jour est envoyé 


//Variables de gestion de l'etat de la porte et des mails
char server_email[] = "smtp.orange.fr";
const unsigned int localPort = 2390;


String MailToSend = "";
boolean DailyMailSent = true;
boolean DoorClosedBack = true; //true : porte refermee
boolean Update_needed = false;
long rssi; //pour mesure RSSI

//variables pour le gestion de la date et du temps
const char* ntpServerName = "time.nist.gov";
const int NTP_PACKET_SIZE = 48; // NTP time stamp is in the first 48 bytes of the message
byte packetBuffer[ NTP_PACKET_SIZE]; //buffer to hold incoming and outgoing packets
unsigned long secsSince1900 = 0;
const unsigned long seventyYears = 2208988800UL;
int Hour;
int Minute;
int Second;
int Day;
int DayofWeek; // Sunday is day 0
int Month;     // Jan is month 0
int Year;      // the Year minus 1900
int WeekDay;

//Variable pour la gestion de thingspeak
const char* server = "mqtt.thingspeak.com";// Define the ThingSpeak MQTT broker
unsigned long lastConnectionTime = 0; // track the last connection time
const unsigned long postingInterval = 1L * 1000L;// post data every 1 seconds
const unsigned long RegularpostingInterval = 1 * 60 * 1000L;// post data every 1 min
time_t epoch = 0; // contient
IPAddress ip;
IPAddress timeServerIP;

WiFiClient client;  // Initialize the Wifi client library.
WiFiUDP udp; //A UDP instance to let us send and receive packets over UDP
PubSubClient mqttClient(client); // Initialize the PuBSubClient library

//************************Debut de setup*************************
#line 94 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void setup();
#line 196 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void loop();
#line 252 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void UpdateTime();
#line 338 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void GetTimeByUDP();
#line 390 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void sendNTPpacket(IPAddress& address);
#line 416 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void sendDailyMail();
#line 439 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
byte sendEmail(String FcMailFrom, String FcMailTo, String FcMailContent, String FcThingspeakChannelAdress, String FcThingspeakChannelWriteAPIKey);
#line 530 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
byte eRcv();
#line 568 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void efail();
#line 602 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void reconnect();
#line 632 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void mqttpublish();
#line 650 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void mqttpublishtry();
#line 669 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void WifiConnexionManager();
#line 724 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void WifiConnectOwner(char* SSIDowner_fct, char* passwordowner_fct);
#line 756 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void WaitConnexion();
#line 805 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
int getSensorsOnBus();
#line 810 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
byte discoverOneWireDevices();
#line 826 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void printAddress(DeviceAddress addr);
#line 841 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void printTemperature(DeviceAddress addr);
#line 857 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
float readTemperature(DeviceAddress addr);
#line 867 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
byte findOnboardDevice(byte addr[3][8], DeviceAddress SensorToCompare);
#line 898 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
byte findChaufDevice(byte addr[3][8], DeviceAddress SensorToCompare, byte excludedDevice);
#line 94 "C:\\Users\\cgueble\\Documents\\Arduino\\ESP8266_Thermo_Num\\Wifi-thermo-num\\Wifi-thermo-num.ino"
void setup() {
  delay(1000);
  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.begin(115200);
    delay(1000);
    Serial.println("debut de setup");
  }

  //Set up PIN in INPUT


//Set up PIN in OUTPUT
  pinMode(thermo_Power, OUTPUT);// on definit comme output le port qui servira a monitorer la temperature
  digitalWrite(thermo_Power, HIGH);// on commence par couper l'alim des capteurs
 
  
//Debut de connexion intenet  
  while ((WiFi.status() != WL_CONNECTED) && AvecWifi) {
    WiFi.disconnect();
    WifiConnexionManager();//Recherche reseau wifi + connexion
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print(".");
      delay(1000);
      Serial.print(".");
      delay(1000);
      Serial.print(".\r");
      delay(1000);
      Serial.println("   \r");
    }
  }//Loop connexion until Wifi Connetion is OK

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("");
    Serial.println("WiFi connected");
    Serial.print("Use this URL to connect: ");
    Serial.print("http://");
    Serial.print(WiFi.localIP());
    Serial.println("/");
  }
 if(AvecWifi){
  udp.begin(localPort);// Start UDP port for connexion to NTP server

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("Starting UDP");
    Serial.print("Local port: ");
    Serial.println(udp.localPort());
  }

  GetTimeByUDP();
  UpdateTime();
  mqttClient.setServer(server, 1883);// Set the MQTT broker details
}
  //Init des sensors
  //Initialize the Temperature measurement library
  sensors.begin();

