cgueble/ESP8266_Thermo_Num/Wifi-thermo-num/build/sketch/Wifi-thermo-num.ino.cpp
  totalDevices = discoverOneWireDevices();         // get addresses of our one wire devices into allAddress array 
  Serial.print("totalDevices = ");
  Serial.println(totalDevices);
  for (byte i=0; i < totalDevices; i++){ 
  Serial.print("sensors.setResolution(");
  Serial.print(i);  
  Serial.print(",");
  Serial.println("9)");
  sensors.setResolution(allAddress[i], 9);      // and set the a to d conversion resolution of each.
    }

  Serial.println("System initialized");  
  delay(1000);
  sensors.requestTemperatures();                // Initiate  temperature request to all devices
  delay(1000);
// float tempAdresse0 = readTemperature(allAddress[0]);
// float tempAdresse1 = readTemperature(allAddress[1]);
// float tempAdresse2 = readTemperature(allAddress[2]);

//Find the adress of the sensor on the board

onBoardDeviceNumber = findOnboardDevice(allAddress, SensorBoard);
chaufDeviceNumber = findChaufDevice(allAddress, SensorBoard, onBoardDeviceNumber);
sensors.requestTemperatures();
Serial.print("Temperature of device n°0= ");
Serial.println(sensors.getTempCByIndex(0));
Serial.print("Temperature of device n°1= ");
Serial.println(sensors.getTempCByIndex(1));
Serial.print("Temperature of device n°2= ");
Serial.println(sensors.getTempCByIndex(2));

Serial.print("on board device n° = ");
Serial.println(onBoardDeviceNumber);
Serial.print("chaufDeviceNumber n° = ");
Serial.println(chaufDeviceNumber);
Serial.print("extDeviceNumber n° = ");
Serial.println(extDeviceNumber);


  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("End of Setup");
  }
}// fin set up
//******************end of setup*************************************
//*******************************************************************
//******************start of loop************************************
void loop() {

  //LoopLog
  if(SERIAL_PORT_LOG_ENABLE){
  Serial.print(".\r");
  delay(100);
  Serial.print("Start of loop\r\n");
  }

  if(AvecWifi){
  WifiConnectOwner((char*)ssid1,(char*)password1);
  UpdateTime();
  rssi = WiFi.RSSI();
  if (Year < 2016) { // si l'heure n'est pas configuree C est a dire si l'annee n'est pas bonne, alors on recupere l'heure sur le serveur NTP
    GetTimeByUDP();
    UpdateTime();
  }

  if ((WiFi.status() != WL_CONNECTED) && AvecWifi) {// si la connexion WIFI est perdue, alors on relance le setup
    WiFi.disconnect();
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Connexion lost ");
    }
    setup();
  }
 }

sensors.requestTemperatures();

Serial.print("Temperature of onBoardDeviceNumber= ");
ThempBoard=sensors.getTempCByIndex(onBoardDeviceNumber);
Serial.println(ThempBoard);

Serial.print("Temperature of extDeviceNumber= ");
ThempExt=sensors.getTempCByIndex(extDeviceNumber);
Serial.println(ThempExt);

Serial.print("Temperature of chaufDeviceNumber= ");
ThempChauf=sensors.getTempCByIndex(chaufDeviceNumber);
Serial.println(ThempChauf);

if (millis() - lastConnectionTime > RegularpostingInterval)
  {
    mqttpublishtry();  
  }

delay(6000);

//ESP.deepSleep(24*3600*1000000, WAKE_NO_RFCAL);  // Sleep pour 1 jour
//ESP.deepSleep(2*60*1000000, WAKE_NO_RFCAL); // Sleep pour 2 minutes
//Waikup on GPIO16 reset.... witch Pin ???



}//*****************END OF LOOP *******************

void UpdateTime() {
  StringDate = ""; // reset StringDate value
  StringTime = ""; // reset StringTime value
  Hour = hour();
  Minute = minute();
  Second = second();
  Year = year();
  Month = month();
  Day = day();
  WeekDay = weekday();

  if ((Month <= 3) || (Month > 10)) { // on est un mois d'hiver
    if ((Month == 3) && (Day - WeekDay > 24)) { //on est dans le dernier mois d'hiver et aprÃ¨s le dernier dimanche
      Hour = Hour + 2;
      StringTime += " UTC+2: ";
      if (Hour >= 22){
        Day = Day + 1;
      }
    }
    else { // toute la periode hivernale
      Hour = Hour + 1;
      StringTime += " UTC+1: ";
        if (Hour >= 23){
        Day = Day + 1;
      }
    }
  }
  else { // on est un mois d'aout
    if ((Month == 10) && (Day - WeekDay > 24)) { //on est dans le dernier mois d'aout et apres le dernier dimanche
      Hour = Hour + 1;
      StringTime += " UTC+1: ";
      if (Hour >= 23){
        Day = Day + 1;
      }
    }
    else { // toute la periode estivale
      Hour = Hour + 2;
      StringTime += " UTC+2: ";
      if (Hour >= 22){
        Day = Day + 1;
      }
    }
  }

  //StringDate += "Date: ";
  if (Day < 10) {
    StringDate += "0";
  }
  StringDate += Day;
  if (Month < 10) {
    StringDate += "/0";
  }
  else {
    StringDate += "/";
  }
  StringDate += Month;
  StringDate += "/";
  StringDate += Year;

  if (Hour < 10) {
    StringTime += "0";
  }
  StringTime += Hour;
  if (Minute < 10) {
    StringTime += ":0";
  }
  else {
    StringTime += ":";
  }
  StringTime += Minute;
  if (Second < 10) {
    StringTime += ":0";
  }
  else {
    StringTime += ":";
  }
  StringTime += Second;
  if (SERIAL_PORT_LOG_ENABLE) {
    //Serial.print("valeure de StringDate ");
    //Serial.println(StringDate);
    //Serial.print("valeure de StringTime ");
    //Serial.println(StringTime);
  }
}//End of Update Time


void GetTimeByUDP() {
  //get a random server from the pool
  WiFi.hostByName(ntpServerName, timeServerIP);

  sendNTPpacket(timeServerIP); // send an NTP packet to a time server
  // wait to see if a reply is available
  delay(1000);


  int cb = udp.parsePacket();

  if (!cb) {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("no packet yet");
    }
  }
  else {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("packet received, length=");
      Serial.println(cb);
    }

    // We've received a packet, read the data from it
    udp.read(packetBuffer, NTP_PACKET_SIZE); // read the packet into the buffer

    //the timestamp starts at byte 40 of the received packet and is four bytes,
    // or two words, long. First, esxtract the two words:

    unsigned long highWord = word(packetBuffer[40], packetBuffer[41]);
    unsigned long lowWord = word(packetBuffer[42], packetBuffer[43]);
    // combine the four bytes (two words) into a long integer
    // this is NTP time (seconds since Jan 1 1900):
    secsSince1900 = highWord << 16 | lowWord;
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("Seconds since Jan 1 1900 = " );
      Serial.println(secsSince1900);
    }

    // now convert NTP time into everyday time:
    // Unix time starts on Jan 1 1970. In seconds, that's 2208988800:
    const unsigned long seventyYears = 2208988800UL;
    // subtract seventy years:
    epoch = secsSince1900 - seventyYears;
    setTime(epoch);

