cgueble/ESP8266_Thermo_Num/Wifi-thermo-num/build/sketch/Wifi-thermo-num.ino.cpp
    if (WiFi.SSID(i) == ssid2) {
      WiFi.begin(ssid2, password2);
      CurentSSID = WiFi.SSID(i);
      WaitConnexion();
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.print("Wifi trouvé. temtative de connexion a: ");
        Serial.println(ssid2);
      }
      break;
    }

    if (WiFi.SSID(i) == ssid0) {
      WiFi.begin(ssid0, password0);
      CurentSSID = WiFi.SSID(i);
      WaitConnexion();
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.print("Wifi trouvé. temtative de connexion a: ");
        Serial.println(ssid0);
        Serial.print("Wifi.status(): ");
        Serial.println(WiFi.status());
      }
      break;
    }
  }//End FOR
  Serial.println("End of WifiConnexionManager");
}//end WifiConnexionManager


void  WifiConnectOwner(char* SSIDowner_fct, char* passwordowner_fct) {
  if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Begin of WifiConnectOwner");
      Serial.println("Already connected to :");
      Serial.println(WiFi.SSID());
  }
  int numberOfNetworks = WiFi.scanNetworks();
  for (int i = 0; i < numberOfNetworks; i++) {
    if ((WiFi.SSID(i) == SSIDowner_fct) && ((String)SSIDowner_fct != CurentSSID)) {
      WiFi.disconnect();
      WiFi.begin(SSIDowner_fct, passwordowner_fct);
      
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.print("Wifi Owner trouve . temtative de connexion a: ");
        Serial.println(SSIDowner_fct);
      }
      WaitConnexion();
      if ((WiFi.status() == WL_CONNECTED))
      {
        CurentSSID = WiFi.SSID(i);
        if (SERIAL_PORT_LOG_ENABLE) {
          Serial.print("connecte a: ");
          Serial.println(SSIDowner_fct);
        }
        
      }
      break;
    }
  }//End FOR
Serial.println("End of WifiConnectOwner");  
}//end WifiConnectOwner

void WaitConnexion(){
      int cpt=30;
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Begin of WaitConnexion");
      Serial.print("cpt= ");
      Serial.print(cpt);
      Serial.print("   WiFi.status= ");
      Serial.print(WiFi.status());
      Serial.print("   WL_CONNECTED= ");
      Serial.println(WL_CONNECTED);
      Serial.print("test = (cpt >= 0) && ((WiFi.status() != WL_CONNECTED)) =  ");
      Serial.println((cpt > 0) && ((WiFi.status() != WL_CONNECTED)));
      }
      while((cpt > 0) && ((WiFi.status() != WL_CONNECTED))){
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("cpt= ");
      Serial.print(cpt);
      Serial.print("   WiFi.status= ");
      Serial.print(WiFi.status());
      Serial.print("   WL_CONNECTED= ");
      Serial.println(WL_CONNECTED);
      Serial.print("test = (cpt >= 0) && ((WiFi.status() != WL_CONNECTED)) =  ");
      Serial.println((cpt > 0) && ((WiFi.status() != WL_CONNECTED)));
      }
      cpt = cpt -1;
      delay(1000);
      }
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("cpt= ");
      Serial.print(cpt);
      Serial.print("   WiFi.status= ");
      Serial.print(WiFi.status());
      Serial.print("   WL_CONNECTED= ");
      Serial.println(WL_CONNECTED);
      Serial.print("test = (cpt >= 0) && ((WiFi.status() != WL_CONNECTED)) =  ");
      Serial.println((cpt > 0) && ((WiFi.status() != WL_CONNECTED)));
      }
      if ((WiFi.status()== WL_CONNECTED))
      {
          if (SERIAL_PORT_LOG_ENABLE) {
             Serial.print("connecte a: ");
             Serial.println(WiFi.SSID());
            }
      } 
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("End of WaitConnexion");  
      }   
}// end Waitconnexion

int getSensorsOnBus() {
//return return sensors.getDeviceCount();
 return sensors.getDeviceCount();
}

byte discoverOneWireDevices() {
  byte j=0;                                        // search for one wire devices and
                                                   // copy to device address arrays.
  while ((j < NumberOfDevices) && (oneWire.search(allAddress[j]))) {        
    j++;
  }
  for (byte i=0; i < j; i++) {
    Serial.print("Device ");
    Serial.print(i);  
    Serial.print(": ");                          
    printAddress(allAddress[i]);                  // print address from each device address arry.
  }
  Serial.print("\r\n");
  return j                      ;                 // return total number of devices found.
}

void printAddress(DeviceAddress addr) {
  byte i;
  for( i=0; i < 8; i++) {                         // prefix the printout with 0x
      Serial.print("0x");
      if (addr[i] < 16) {
        Serial.print('0');                        // add a leading '0' if required.
      }
      Serial.print(addr[i], HEX);                 // print the actual value in HEX
      if (i < 7) {
        Serial.print(", ");
      }
    }
  Serial.print("\r\n");
}

void printTemperature(DeviceAddress addr) {
  float tempC = sensors.getTempC(addr);           // read the device at addr.
  if (tempC == -127.00) {
    Serial.println("Error getting temperature");
  } else {
    Serial.print("sensors.getTempC(addr)");
    Serial.print(sensors.getTempC(addr));                          // and print its value.
    Serial.println(" C (");
    Serial.print("tempC");
    Serial.print(tempC);                          // and print its value.
    Serial.println(" C (");
    Serial.print(DallasTemperature::toFahrenheit(tempC));
    Serial.println(" F)");
  }
}

float readTemperature(DeviceAddress addr) {
  float tempC = sensors.getTempC(addr);           // read the device at addr.
  if (tempC == -127.00) {
    Serial.print("Error getting temperature of device n°");
    
    printAddress(addr);
  } 
  return tempC;
}

byte findOnboardDevice(byte addr[NumberOfDevices][8], DeviceAddress SensorToCompare){
    byte device;
    int i;
    int compare=0;
  for( device=0; device < totalDevices; device++){
    compare=0;   
    Serial.println("searching for onBoard Device");
    for( i=0; i < 8; i++) {                         // prefix the printout with 0x
        Serial.print("0x");
        if (addr[device][i] < 16) {
          Serial.print('0');                        // add a leading '0' if required.
        }
        Serial.print(addr[device][i], HEX);                 // print the actual value in HEX
        if (addr[device][i] == SensorToCompare[i]){
          compare = compare +1;
          }
        if (i < 7) {
          Serial.print(", ");
        }
      }//end For
      Serial.print("\n\r compare = ");
      Serial.println(compare);    
      if (compare == 8){
        Serial.print("On board Device found with n° ");
        Serial.println(device); 
        return device;
        break;
      }
   }// end For
}
 
byte findChaufDevice(byte addr[NumberOfDevices][8], DeviceAddress SensorToCompare, byte excludedDevice){
    byte device;
    byte deviceToReturn;
    int i;
    int compare=0;
    float maxTemp=-125;
    float currentTemp=0;
    for( device=0; device < totalDevices; device++){
          Serial.print("totalDevices = ");
          Serial.println(totalDevices);
          Serial.print("  device = ");
          Serial.print(device);
      currentTemp = readTemperature(addr[device]);
      if(device==excludedDevice){

          Serial.print("  device n° ");
          Serial.print(device);
          Serial.print(" Temperature= ");
          Serial.print(currentTemp);
          Serial.println("   ****  Excluded device ");
          continue;
          }
      else{
          Serial.print("  device n° ");
          Serial.print(device);
          Serial.print(" Temperature= ");
          Serial.println(currentTemp);
          Serial.print(" maxTemp= ");
          Serial.println(maxTemp);
          if(maxTemp < currentTemp){
              Serial.print(" currentTemp= ");
              Serial.println(currentTemp);
              maxTemp = currentTemp;
              deviceToReturn = device;
              Serial.print(" deviceToReturn= ");
              Serial.println(deviceToReturn);
          }
      }//end else
   }// end For
   return deviceToReturn;
}






    

